In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import time
from scipy.stats import linregress
import scipy.stats as st
import json

#import the api key
from CenKey import CensusKey

In [2]:
#https://api.census.gov/data/2021/pep/population?get=PPOPCHG_CUM2021,NAME,STATE&for=state:*&key={0}
#2019 Population census estimations
url = "https://api.census.gov/data/2019/pep/population?get=POP,NAME&for=state:*&key={0}".format(CensusKey)
response = requests.request("GET",url)
Data = json.loads(response.text)
Population2019 = pd.DataFrame(Data)
Population2019

           0                     1      2
0        POP                  NAME  state
1    4903185               Alabama     01
2     731545                Alaska     02
3    7278717               Arizona     04
4    3017804              Arkansas     05
5   39512223            California     06
6    5758736              Colorado     08
7     973764              Delaware     10
8     705749  District of Columbia     11
9    3565287           Connecticut     09
10  21477737               Florida     12
11  10617423               Georgia     13
12   1787065                 Idaho     16
13   1415872                Hawaii     15
14  12671821              Illinois     17
15   6732219               Indiana     18
16   3155070                  Iowa     19
17   2913314                Kansas     20
18   4467673              Kentucky     21
19   4648794             Louisiana     22
20   1344212                 Maine     23
21   6045680              Maryland     24
22   6892503         Massachusetts     25
23   9986857              Michigan     26
24   5639632             Minnesota     27
25   2976149           Mississippi     28
26   6137428              Missouri     29
27   1068778               Montana     30
28   1934408              Nebraska     31
29   3080156                Nevada     32
30   1359711         New Hampshire     33
31   8882190            New Jersey     34
32   2096829            New Mexico     35
33  19453561              New York     36
34  10488084        North Carolina     37
35    762062          North Dakota     38
36  11689100                  Ohio     39
37   3956971              Oklahoma     40
38   4217737                Oregon     41
39  12801989          Pennsylvania     42
40   1059361          Rhode Island     44
41   5148714        South Carolina     45
42    884659          South Dakota     46
43   6829174             Tennessee     47
44  28995881                 Texas     48
45    623989               Vermont     50
46   3205958                  Utah     49
47   8535519              Virginia     51
48   7614893            Washington     53
49   1792147         West Virginia     54
50   5822434             Wisconsin     55
51    578759               Wyoming     56
52   3193694           Puerto Rico     72

In [3]:
#2018 Population census estimations
url = "https://api.census.gov/data/2018/pep/population?get=POP,GEONAME&for=state:*&key={0}".format(CensusKey)
response = requests.request("GET",url)
Data = json.loads(response.text)
Population2018 = pd.DataFrame(Data)
Population2018

           0                     1      2
0        POP               GEONAME  state
1    4887871               Alabama     01
2     737438                Alaska     02
3    7171646               Arizona     04
4    3013825              Arkansas     05
5   39557045            California     06
6    5695564              Colorado     08
7    3572665           Connecticut     09
8     967171              Delaware     10
9     702455  District of Columbia     11
10  21299325               Florida     12
11  10519475               Georgia     13
12   1420491                Hawaii     15
13   1754208                 Idaho     16
14  12741080              Illinois     17
15   6691878               Indiana     18
16   3156145                  Iowa     19
17   2911505                Kansas     20
18   4468402              Kentucky     21
19   4659978             Louisiana     22
20   1338404                 Maine     23
21   6042718              Maryland     24
22   6902149         Massachusetts     25
23   9995915              Michigan     26
24   5611179             Minnesota     27
25   2986530           Mississippi     28
26   6126452              Missouri     29
27   1062305               Montana     30
28   1929268              Nebraska     31
29   3034392                Nevada     32
30   1356458         New Hampshire     33
31   8908520            New Jersey     34
32   2095428            New Mexico     35
33  19542209              New York     36
34  10383620        North Carolina     37
35    760077          North Dakota     38
36  11689442                  Ohio     39
37   3943079              Oklahoma     40
38   4190713                Oregon     41
39  12807060          Pennsylvania     42
40   1057315          Rhode Island     44
41   5084127        South Carolina     45
42    882235          South Dakota     46
43   6770010             Tennessee     47
44  28701845                 Texas     48
45   3161105                  Utah     49
46    626299               Vermont     50
47   8517685              Virginia     51
48   7535591            Washington     53
49   1805832         West Virginia     54
50   5813568             Wisconsin     55
51    577737               Wyoming     56
52   3195153           Puerto Rico     72

In [4]:
#2019 Population Race census estimation for White people
url = "https://api.census.gov/data/2019/pep/charagegroups?get=NAME,POP&RACE=1&for=state:*&key={0}".format(CensusKey)
response = requests.request("GET",url)
Data = json.loads(response.text)
WPeople = pd.DataFrame(Data)
WPeople
#2019 Population Race census estimation for Black people
url = "https://api.census.gov/data/2019/pep/charagegroups?get=NAME,POP&RACE=2&for=state:*&key={0}".format(CensusKey)
response = requests.request("GET",url)
Data = json.loads(response.text)
BPeople = pd.DataFrame(Data)
BPeople
#2019 Population Race census estimation for American Indian and Alaska Native peoples
url = "https://api.census.gov/data/2019/pep/charagegroups?get=NAME,POP&RACE=3&for=state:*&key={0}".format(CensusKey)
response = requests.request("GET",url)
Data = json.loads(response.text)
AiAnPeople = pd.DataFrame(Data)
AiAnPeople
#2019 Population Race census estimation for Asian people
url = "https://api.census.gov/data/2019/pep/charagegroups?get=NAME,POP&RACE=4&for=state:*&key={0}".format(CensusKey)
response = requests.request("GET",url)
Data = json.loads(response.text)
AsPeople = pd.DataFrame(Data)
AsPeople
#2019 Population Race census estimation for Native Hawaiian and Other Pacific Islander peoples
url = "https://api.census.gov/data/2019/pep/charagegroups?get=NAME,POP&RACE=5&for=state:*&key={0}".format(CensusKey)
response = requests.request("GET",url)
Data = json.loads(response.text)
HOPPeople = pd.DataFrame(Data)
HOPPeople

                       0       1     2      3
0                   NAME     POP  RACE  state
1            Mississippi    1806     5     28
2               Missouri    9857     5     29
3                Montana     920     5     30
4               Nebraska    2349     5     31
5                 Nevada   24585     5     32
6          New Hampshire     672     5     33
7             New Jersey   10240     5     34
8             New Mexico    3341     5     35
9               New York   27034     5     36
10        North Carolina   13130     5     37
11          North Dakota     615     5     38
12                  Ohio    7055     5     39
13              Oklahoma    8581     5     40
14                Oregon   19245     5     41
15          Pennsylvania    9994     5     42
16          Rhode Island    2125     5     44
17        South Carolina    5065     5     45
18          South Dakota     787     5     46
19             Tennessee    6578     5     47
20                 Texas   43212     5     48
21               Vermont     247     5     50
22                  Utah   33979     5     49
23              Virginia   10092     5     51
24            Washington   60349     5     53
25         West Virginia     530     5     54
26             Wisconsin    3419     5     55
27               Wyoming     596     5     56
28               Alabama    5110     5     01
29                Alaska   10498     5     02
30               Arizona   20169     5     04
31              Arkansas   11786     5     05
32            California  199805     5     06
33              Colorado   11329     5     08
34              Delaware    1059     5     10
35  District of Columbia     923     5     11
36           Connecticut    3879     5     09
37               Florida   24641     5     12
38               Georgia   12411     5     13
39                 Idaho    3944     5     16
40                Hawaii  143549     5     15
41              Illinois    8385     5     17
42               Indiana    4539     5     18
43                  Iowa    4804     5     19
44                Kansas    3687     5     20
45              Kentucky    4192     5     21
46             Louisiana    2854     5     22
47                 Maine     455     5     23
48              Maryland    6705     5     24
49         Massachusetts    7410     5     25
50              Michigan    4186     5     26
51             Minnesota    4214     5     27

In [5]:
#2018 Population Race census estimation for White people
url = "https://api.census.gov/data/2018/pep/charagegroups?get=GEONAME,POP&RACE=1&for=state:*&key={0}".format(CensusKey)
response = requests.request("GET",url)
Data = json.loads(response.text)
WPeople18 = pd.DataFrame(Data)
WPeople18
#2018 Population Race census estimation for Black people
url = "https://api.census.gov/data/2018/pep/charagegroups?get=GEONAME,POP&RACE=2&for=state:*&key={0}".format(CensusKey)
response = requests.request("GET",url)
Data = json.loads(response.text)
BPeople18 = pd.DataFrame(Data)
BPeople18
#2018 Population Race census estimation for American Indian and Alaska Native peoples
url = "https://api.census.gov/data/2018/pep/charagegroups?get=GEONAME,POP&RACE=3&for=state:*&key={0}".format(CensusKey)
response = requests.request("GET",url)
Data = json.loads(response.text)
AiAnPeople18 = pd.DataFrame(Data)
AiAnPeople18
#2018 Population Race census estimation for Asian people
url = "https://api.census.gov/data/2018/pep/charagegroups?get=GEONAME,POP&RACE=4&for=state:*&key={0}".format(CensusKey)
response = requests.request("GET",url)
Data = json.loads(response.text)
AsPeople18 = pd.DataFrame(Data)
AsPeople18
#2018 Population Race census estimation for Native Hawaiian and Other Pacific Islander peoples
url = "https://api.census.gov/data/2018/pep/charagegroups?get=GEONAME,POP&RACE=5&for=state:*&key={0}".format(CensusKey)
response = requests.request("GET",url)
Data = json.loads(response.text)
HOPPeople18 = pd.DataFrame(Data)
HOPPeople18

                       0       1     2      3
0                GEONAME     POP  RACE  state
1                Alabama    5207     5     01
2                 Alaska   10221     5     02
3                Arizona   19789     5     04
4               Arkansas   10881     5     05
5             California  199872     5     06
6               Colorado   10933     5     08
7            Connecticut    3840     5     09
8               Delaware    1049     5     10
9   District of Columbia     975     5     11
10               Florida   24353     5     12
11               Georgia   12432     5     13
12                Hawaii  144806     5     15
13                 Idaho    3883     5     16
14              Illinois    8445     5     17
15               Indiana    4542     5     18
16                  Iowa    4232     5     19
17                Kansas    3619     5     20
18              Kentucky    4058     5     21
19             Louisiana    2889     5     22
20                 Maine     455     5     23
21              Maryland    6746     5     24
22         Massachusetts    7417     5     25
23              Michigan    4142     5     26
24             Minnesota    4145     5     27
25           Mississippi    1812     5     28
26              Missouri    9585     5     29
27               Montana     893     5     30
28              Nebraska    2338     5     31
29                Nevada   23962     5     32
30         New Hampshire     637     5     33
31            New Jersey    9984     5     34
32            New Mexico    3404     5     35
33              New York   26745     5     36
34        North Carolina   12989     5     37
35          North Dakota     573     5     38
36                  Ohio    6994     5     39
37              Oklahoma    7568     5     40
38                Oregon   18999     5     41
39          Pennsylvania   10056     5     42
40          Rhode Island    2135     5     44
41        South Carolina    5153     5     45
42          South Dakota     747     5     46
43             Tennessee    6496     5     47
44                 Texas   42333     5     48
45                  Utah   33495     5     49
46               Vermont     247     5     50
47              Virginia    9998     5     51
48            Washington   59001     5     53
49         West Virginia     528     5     54
50             Wisconsin    3243     5     55
51               Wyoming     572     5     56

In [6]:
Population2019

           0                     1      2
0        POP                  NAME  state
1    4903185               Alabama     01
2     731545                Alaska     02
3    7278717               Arizona     04
4    3017804              Arkansas     05
5   39512223            California     06
6    5758736              Colorado     08
7     973764              Delaware     10
8     705749  District of Columbia     11
9    3565287           Connecticut     09
10  21477737               Florida     12
11  10617423               Georgia     13
12   1787065                 Idaho     16
13   1415872                Hawaii     15
14  12671821              Illinois     17
15   6732219               Indiana     18
16   3155070                  Iowa     19
17   2913314                Kansas     20
18   4467673              Kentucky     21
19   4648794             Louisiana     22
20   1344212                 Maine     23
21   6045680              Maryland     24
22   6892503         Massachusetts     25
23   9986857              Michigan     26
24   5639632             Minnesota     27
25   2976149           Mississippi     28
26   6137428              Missouri     29
27   1068778               Montana     30
28   1934408              Nebraska     31
29   3080156                Nevada     32
30   1359711         New Hampshire     33
31   8882190            New Jersey     34
32   2096829            New Mexico     35
33  19453561              New York     36
34  10488084        North Carolina     37
35    762062          North Dakota     38
36  11689100                  Ohio     39
37   3956971              Oklahoma     40
38   4217737                Oregon     41
39  12801989          Pennsylvania     42
40   1059361          Rhode Island     44
41   5148714        South Carolina     45
42    884659          South Dakota     46
43   6829174             Tennessee     47
44  28995881                 Texas     48
45    623989               Vermont     50
46   3205958                  Utah     49
47   8535519              Virginia     51
48   7614893            Washington     53
49   1792147         West Virginia     54
50   5822434             Wisconsin     55
51    578759               Wyoming     56
52   3193694           Puerto Rico     72

Cleaning Population2019 and Population2018

In [7]:
#renaming columns and deleting the first column for successful merge
Population2019.columns = ['POP2019', 'STATE', 'STATEID']
Population2018.columns = ['POP2018', 'STATE', 'STATEID']

Population2019 = Population2019.drop(0)
Population2018 = Population2018.drop(0)

In [8]:
Population2019.head(5)

    POP2019       STATE STATEID
1   4903185     Alabama      01
2    731545      Alaska      02
3   7278717     Arizona      04
4   3017804    Arkansas      05
5  39512223  California      06

In [9]:
Population2018.head(5)

    POP2018       STATE STATEID
1   4887871     Alabama      01
2    737438      Alaska      02
3   7171646     Arizona      04
4   3013825    Arkansas      05
5  39557045  California      06

In [10]:
Population2019.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 1 to 52
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   POP2019  52 non-null     object
 1   STATE    52 non-null     object
 2   STATEID  52 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

In [11]:
Population2018.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 1 to 52
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   POP2018  52 non-null     object
 1   STATE    52 non-null     object
 2   STATEID  52 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

In [12]:
#changing POP2019, POP2018, and STATEID for both df's types from string to numeric values
Population2019["POP2019"] = Population2019["POP2019"].astype(int)
Population2019["STATEID"] = Population2019["STATEID"].astype(int)

Population2018["POP2018"] = Population2018["POP2018"].astype(int)
Population2018["STATEID"] = Population2018["STATEID"].astype(int)

In [13]:
Population2019.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 1 to 52
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   POP2019  52 non-null     int32
 1   STATE    52 non-null     object
 2   STATEID  52 non-null     int32
dtypes: int32(2), object(1)
memory usage: 964.0+ bytes

In [14]:
Population2018.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 1 to 52
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   POP2018  52 non-null     int32
 1   STATE    52 non-null     object
 2   STATEID  52 non-null     int32
dtypes: int32(2), object(1)
memory usage: 964.0+ bytes

What is the percentage change in the population for each state in the United States from 2018 to 2019?

In [15]:
#merging the dfs
Population_Changes = pd.merge(Population2019, Population2018, on=['STATE', 'STATEID'])

#creating the percentage changes column
Population_Changes['PERCENT'] = ((Population_Changes['POP2019'] - Population_Changes['POP2018'])/(Population_Changes['POP2018'].abs()))*100
Population_Changes['CHANGE'] = Population_Changes['POP2019'] - Population_Changes['POP2018']
Population_Changes = Population_Changes.drop(columns=['POP2019', 'POP2018'])

order = ['STATEID', 'STATE', 'CHANGE', 'PERCENT']
Population_Changes = Population_Changes[order]

Population_Changes.head(5)

   STATEID       STATE  CHANGE   PERCENT
0        1     Alabama   15314  0.313306
1        2      Alaska   -5893 -0.799118
2        4     Arizona  107071  1.492977
3        5    Arkansas    3979  0.132025
4        6  California  -44822 -0.113310

In [16]:
#converting this dataframe into a csv file
file_path = 'Population_Changes.csv'
Population_Changes.to_csv(file_path, index=False)

What is the overall percentage change in the population of the United States from 2018 to 2019?

In [17]:
#overall population percentage change was 0.32%
overall_percent_change = ((Population2019['POP2019'].sum() - Population2018['POP2018'].sum())/abs(Population2018['POP2018'].sum()))*100
overall_percent_change

0.32407725394159115

Cleaning all of the race dataframes to determine race shifts in the US

In [18]:
WPeople.head(5)

             0        1     2      3
0         NAME      POP  RACE  state
1  Mississippi  1758081     1     28
2     Missouri  5086188     1     29
3      Montana   950211     1     30
4     Nebraska  1704129     1     31

In [19]:
WPeople18.head(5)

          0        1     2      3
0   GEONAME      POP  RACE  state
1   Alabama  3379955     1     01
2    Alaska   481879     1     02
3   Arizona  5937806     1     04
4  Arkansas  2385213     1     05

In [20]:
#renaming columns for WPeople and WPeople18 and deleting the first column
WPeople.columns = ['STATE', 'WHITEPOP19', 'RACEID', 'STATEID']
WPeople18.columns = ['STATE', 'WHITEPOP18', 'RACEID', 'STATEID']

WPeople = WPeople.drop(0)
WPeople18 = WPeople18.drop(0)

In [21]:
#deleting race id values 
WPeople = WPeople.drop(columns=['RACEID'])
WPeople18 = WPeople18.drop(columns=['RACEID'])

In [22]:
WPeople.head(5)

         STATE WHITEPOP19 STATEID
1  Mississippi    1758081      28
2     Missouri    5086188      29
3      Montana     950211      30
4     Nebraska    1704129      31
5       Nevada    2277552      32

In [23]:
WPeople18.head(5)

        STATE WHITEPOP18 STATEID
1     Alabama    3379955      01
2      Alaska     481879      02
3     Arizona    5937806      04
4    Arkansas    2385213      05
5  California   28531740      06

In [24]:
WPeople.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STATE       51 non-null     object
 1   WHITEPOP19  51 non-null     object
 2   STATEID     51 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

In [25]:
WPeople18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STATE       51 non-null     object
 1   WHITEPOP18  51 non-null     object
 2   STATEID     51 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

In [26]:
#changing WHITEPOP18, WHITEPOP19, and STATEID for both df's types from string to numeric values
WPeople["WHITEPOP19"] = WPeople["WHITEPOP19"].astype(int)
WPeople["STATEID"] = WPeople["STATEID"].astype(int)

WPeople18["WHITEPOP18"] = WPeople18["WHITEPOP18"].astype(int)
WPeople18["STATEID"] = WPeople18["STATEID"].astype(int)

In [27]:
WPeople.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STATE       51 non-null     object
 1   WHITEPOP19  51 non-null     int32
 2   STATEID     51 non-null     int32
dtypes: int32(2), object(1)
memory usage: 948.0+ bytes

In [28]:
WPeople18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STATE       51 non-null     object
 1   WHITEPOP18  51 non-null     int32
 2   STATEID     51 non-null     int32
dtypes: int32(2), object(1)
memory usage: 948.0+ bytes

In [29]:
BPeople.head(5)

             0        1     2      3
0         NAME      POP  RACE  state
1  Mississippi  1124559     2     28
2     Missouri   725579     2     29
3      Montana     6389     2     30
4     Nebraska   100763     2     31

In [30]:
BPeople18.head(5)

          0        1     2      3
0   GEONAME      POP  RACE  state
1   Alabama  1310802     2     01
2    Alaska    27942     2     02
3   Arizona   364280     2     04
4  Arkansas   472287     2     05

In [31]:
#renaming columns for BPeople and BPeople18 and deleting the first column
BPeople.columns = ['STATE', 'BLACKPOP19', 'RACEID', 'STATEID']
BPeople18.columns = ['STATE', 'BLACKPOP18', 'RACEID', 'STATEID']

BPeople = BPeople.drop(0)
BPeople18 = BPeople18.drop(0)

In [32]:
#deleting race id values 
BPeople = BPeople.drop(columns=['RACEID'])
BPeople18 = BPeople18.drop(columns=['RACEID'])

In [33]:
BPeople.head(5)

         STATE BLACKPOP19 STATEID
1  Mississippi    1124559      28
2     Missouri     725579      29
3      Montana       6389      30
4     Nebraska     100763      31
5       Nevada     316303      32

In [34]:
BPeople18.head(5)

        STATE BLACKPOP18 STATEID
1     Alabama    1310802      01
2      Alaska      27942      02
3     Arizona     364280      04
4    Arkansas     472287      05
5  California    2556000      06

In [35]:
BPeople.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STATE       51 non-null     object
 1   BLACKPOP19  51 non-null     object
 2   STATEID     51 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

In [36]:
BPeople18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STATE       51 non-null     object
 1   BLACKPOP18  51 non-null     object
 2   STATEID     51 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

In [37]:
#changing BLACKPOP18, BLACKPOP19, and STATEID for both df's types from string to numeric values
BPeople["BLACKPOP19"] = BPeople["BLACKPOP19"].astype(int)
BPeople["STATEID"] = BPeople["STATEID"].astype(int)

BPeople18["BLACKPOP18"] = BPeople18["BLACKPOP18"].astype(int)
BPeople18["STATEID"] = BPeople18["STATEID"].astype(int)

In [38]:
BPeople.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STATE       51 non-null     object
 1   BLACKPOP19  51 non-null     int32
 2   STATEID     51 non-null     int32
dtypes: int32(2), object(1)
memory usage: 948.0+ bytes

In [39]:
BPeople18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STATE       51 non-null     object
 1   BLACKPOP18  51 non-null     int32
 2   STATEID     51 non-null     int32
dtypes: int32(2), object(1)
memory usage: 948.0+ bytes

In [40]:
AiAnPeople.head(5)

             0      1     2      3
0         NAME    POP  RACE  state
1  Mississippi  18705     3     28
2     Missouri  35839     3     29
3      Montana  71096     3     30
4     Nebraska  29285     3     31

In [41]:
AiAnPeople18.head(5)

          0       1     2      3
0   GEONAME     POP  RACE  state
1   Alabama   34375     3     01
2    Alaska  113516     3     02
3   Arizona  380160     3     04
4  Arkansas   30225     3     05

In [42]:
#renaming columns for AiAnPeople and AiAnPeople18 and deleting the first column
AiAnPeople.columns = ['STATE', 'AIANPOP19', 'RACEID', 'STATEID']
AiAnPeople18.columns = ['STATE', 'AIANPOP18', 'RACEID', 'STATEID']

AiAnPeople = AiAnPeople.drop(0)
AiAnPeople18 = AiAnPeople18.drop(0)

In [43]:
#deleting race id values 
AiAnPeople = AiAnPeople.drop(columns=['RACEID'])
AiAnPeople18 = AiAnPeople18.drop(columns=['RACEID'])

In [44]:
AiAnPeople.head(5)

         STATE AIANPOP19 STATEID
1  Mississippi     18705      28
2     Missouri     35839      29
3      Montana     71096      30
4     Nebraska     29285      31
5       Nevada     51946      32

In [45]:
AiAnPeople18.head(5)

        STATE AIANPOP18 STATEID
1     Alabama     34375      01
2      Alaska    113516      02
3     Arizona    380160      04
4    Arkansas     30225      05
5  California    651076      06

In [46]:
AiAnPeople.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   STATE      51 non-null     object
 1   AIANPOP19  51 non-null     object
 2   STATEID    51 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

In [47]:
AiAnPeople18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   STATE      51 non-null     object
 1   AIANPOP18  51 non-null     object
 2   STATEID    51 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

In [48]:
#changing AIANPOP18, AIANPOP19, and STATEID for both df's types from string to numeric values
AiAnPeople["AIANPOP19"] = AiAnPeople["AIANPOP19"].astype(int)
AiAnPeople["STATEID"] = AiAnPeople["STATEID"].astype(int)

AiAnPeople18["AIANPOP18"] = AiAnPeople18["AIANPOP18"].astype(int)
AiAnPeople18["STATEID"] = AiAnPeople18["STATEID"].astype(int)

In [49]:
AiAnPeople.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   STATE      51 non-null     object
 1   AIANPOP19  51 non-null     int32
 2   STATEID    51 non-null     int32
dtypes: int32(2), object(1)
memory usage: 948.0+ bytes

In [50]:
AiAnPeople18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   STATE      51 non-null     object
 1   AIANPOP18  51 non-null     int32
 2   STATEID    51 non-null     int32
dtypes: int32(2), object(1)
memory usage: 948.0+ bytes

In [51]:
AsPeople.head(5)

             0       1     2      3
0         NAME     POP  RACE  state
1  Mississippi   33032     4     28
2     Missouri  133312     4     29
3      Montana    9833     4     30
4     Nebraska   53187     4     31

In [52]:
AsPeople18.head(5)

          0       1     2      3
0   GEONAME     POP  RACE  state
1   Alabama   73167     4     01
2    Alaska   49025     4     02
3   Arizona  263696     4     04
4  Arkansas   50301     4     05

In [53]:
#renaming columns for AsPeople and AsPeople18 and deleting the first column
AsPeople.columns = ['STATE', 'ASPOP19', 'RACEID', 'STATEID']
AsPeople18.columns = ['STATE', 'ASPOP18', 'RACEID', 'STATEID']

AsPeople = AsPeople.drop(0)
AsPeople18 = AsPeople18.drop(0)

In [54]:
#deleting race id values 
AsPeople = AsPeople.drop(columns=['RACEID'])
AsPeople18 = AsPeople18.drop(columns=['RACEID'])

In [55]:
AsPeople.head(5)

         STATE ASPOP19 STATEID
1  Mississippi   33032      28
2     Missouri  133312      29
3      Montana    9833      30
4     Nebraska   53187      31
5       Nevada  268166      32

In [56]:
AsPeople18.head(5)

        STATE  ASPOP18 STATEID
1     Alabama    73167      01
2      Alaska    49025      02
3     Arizona   263696      04
4    Arkansas    50301      05
5  California  6063600      06

In [57]:
AsPeople.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   STATE    51 non-null     object
 1   ASPOP19  51 non-null     object
 2   STATEID  51 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

In [58]:
AsPeople18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   STATE    51 non-null     object
 1   ASPOP18  51 non-null     object
 2   STATEID  51 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

In [59]:
#changing ASPOP18, ASPOP19, and STATEID for both df's types from string to numeric values
AsPeople["ASPOP19"] = AsPeople["ASPOP19"].astype(int)
AsPeople["STATEID"] = AsPeople["STATEID"].astype(int)

AsPeople18["ASPOP18"] = AsPeople18["ASPOP18"].astype(int)
AsPeople18["STATEID"] = AsPeople18["STATEID"].astype(int)

In [60]:
AsPeople.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   STATE    51 non-null     object
 1   ASPOP19  51 non-null     int32
 2   STATEID  51 non-null     int32
dtypes: int32(2), object(1)
memory usage: 948.0+ bytes

In [61]:
AsPeople18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   STATE    51 non-null     object
 1   ASPOP18  51 non-null     int32
 2   STATEID  51 non-null     int32
dtypes: int32(2), object(1)
memory usage: 948.0+ bytes

In [62]:
HOPPeople.head(5)

             0     1     2      3
0         NAME   POP  RACE  state
1  Mississippi  1806     5     28
2     Missouri  9857     5     29
3      Montana   920     5     30
4     Nebraska  2349     5     31

In [63]:
HOPPeople18.head(5)

          0      1     2      3
0   GEONAME    POP  RACE  state
1   Alabama   5207     5     01
2    Alaska  10221     5     02
3   Arizona  19789     5     04
4  Arkansas  10881     5     05

In [64]:
#renaming columns for HOPPeople and HOPPeople18 and deleting the first column
HOPPeople.columns = ['STATE', 'HOPPOP19', 'RACEID', 'STATEID']
HOPPeople18.columns = ['STATE', 'HOPPOP18', 'RACEID', 'STATEID']

HOPPeople = HOPPeople.drop(0)
HOPPeople18 = HOPPeople18.drop(0)

In [65]:
#deleting race id values 
HOPPeople = HOPPeople.drop(columns=['RACEID'])
HOPPeople18 = HOPPeople18.drop(columns=['RACEID'])

In [66]:
HOPPeople.head(5)

         STATE HOPPOP19 STATEID
1  Mississippi     1806      28
2     Missouri     9857      29
3      Montana      920      30
4     Nebraska     2349      31
5       Nevada    24585      32

In [67]:
HOPPeople18.head(5)

        STATE HOPPOP18 STATEID
1     Alabama     5207      01
2      Alaska    10221      02
3     Arizona    19789      04
4    Arkansas    10881      05
5  California   199872      06

In [68]:
HOPPeople.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   STATE     51 non-null     object
 1   HOPPOP19  51 non-null     object
 2   STATEID   51 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

In [69]:
HOPPeople18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   STATE     51 non-null     object
 1   HOPPOP18  51 non-null     object
 2   STATEID   51 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

In [70]:
#changing HOPPOP18, HOPPOP19, and STATEID for both df's types from string to numeric values
HOPPeople["HOPPOP19"] = HOPPeople["HOPPOP19"].astype(int)
HOPPeople["STATEID"] = HOPPeople["STATEID"].astype(int)

HOPPeople18["HOPPOP18"] = HOPPeople18["HOPPOP18"].astype(int)
HOPPeople18["STATEID"] = HOPPeople18["STATEID"].astype(int)

In [71]:
HOPPeople.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   STATE     51 non-null     object
 1   HOPPOP19  51 non-null     int32
 2   STATEID   51 non-null     int32
dtypes: int32(2), object(1)
memory usage: 948.0+ bytes

In [72]:
HOPPeople18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   STATE     51 non-null     object
 1   HOPPOP18  51 non-null     int32
 2   STATEID   51 non-null     int32
dtypes: int32(2), object(1)
memory usage: 948.0+ bytes

In [73]:
#merging the race dfs
Race_Info = pd.merge(HOPPeople18, HOPPeople, on=['STATE', 'STATEID'])
Race_Info = pd.merge(Race_Info, AsPeople, on=['STATE', 'STATEID'])
Race_Info = pd.merge(Race_Info, AsPeople18, on=['STATE', 'STATEID'])
Race_Info = pd.merge(Race_Info, AiAnPeople18, on=['STATE', 'STATEID'])
Race_Info = pd.merge(Race_Info, AiAnPeople, on=['STATE', 'STATEID'])
Race_Info = pd.merge(Race_Info, BPeople, on=['STATE', 'STATEID'])
Race_Info = pd.merge(Race_Info, BPeople18, on=['STATE', 'STATEID'])
Race_Info = pd.merge(Race_Info, WPeople, on=['STATE', 'STATEID'])
Race_Info = pd.merge(Race_Info, WPeople18, on=['STATE', 'STATEID'])

new_order = ['STATEID', 'STATE', 'WHITEPOP18', 'WHITEPOP19', 'BLACKPOP18', 'BLACKPOP19', 'AIANPOP18', 'AIANPOP19', 'ASPOP18', 'ASPOP19', 'HOPPOP18', 'HOPPOP19']
Race_Info = Race_Info[new_order]

Race_Info.head(5)

,STATEID,STATE,WHITEPOP18,WHITEPOP19,BLACKPOP18,BLACKPOP19,AIANPOP18,AIANPOP19,ASPOP18,ASPOP19,HOPPOP18,HOPPOP19
0,1,Alabama,3379955,3389396,1310802,1313291,34375,34799,73167,73715,5207,5110
1,2,Alaska,481879,477488,27942,27108,113516,113953,49025,47799,10221,10498
2,4,Arizona,5937806,6013442,364280,376997,380160,385903,263696,268723,19789,20169
3,5,Arkansas,2385213,2385258,472287,473048,30225,30717,50301,50403,10881,11786
4,6,California,28531740,28424739,2556000,2552757,651076,649862,6063600,6110945,199872,199805

In [74]:
#converting into CSV
file_path = 'Race_Info'
Race_Info.to_csv(file_path, index=False)

What is the racial composition change in the United States from 2018 to 2019?

In [75]:
#calc the total population for 2018 and 2019
total_population_2018 = Population2018['POP2018'].sum()
total_population_2019 = Population2019['POP2019'].sum()

#calc the percentage distribution for each race in 2018 and 2019
white_percentage_2018 = (Race_Info['WHITEPOP18'].sum() / total_population_2018) * 100
black_percentage_2018 = (Race_Info['BLACKPOP18'].sum() / total_population_2018) * 100
aian_percentage_2018 = (Race_Info['AIANPOP18'].sum() / total_population_2018) * 100
asian_percentage_2018 = (Race_Info['ASPOP18'].sum() / total_population_2018) * 100
pacific_percentage_2018 = (Race_Info['HOPPOP18'].sum() / total_population_2018) * 100

white_percentage_2019 = (Race_Info['WHITEPOP19'].sum() / total_population_2018) * 100
black_percentage_2019 = (Race_Info['BLACKPOP19'].sum() / total_population_2018) * 100
aian_percentage_2019 = (Race_Info['AIANPOP19'].sum() / total_population_2018) * 100
asian_percentage_2019 = (Race_Info['ASPOP19'].sum() / total_population_2018) * 100
pacific_percentage_2019 = (Race_Info['HOPPOP19'].sum() / total_population_2018) * 100

#calc percentage changes in distribution
white_percentage_change = white_percentage_2019 - white_percentage_2018
black_percentage_change = black_percentage_2019 - black_percentage_2018
aian_percentage_change = aian_percentage_2019 - aian_percentage_2018
asian_percentage_change = asian_percentage_2019 - asian_percentage_2018
pacific_percentage_change = pacific_percentage_2019 - pacific_percentage_2018

data = {
    'Race': ['White', 'Black', 'American Indian and Alaska Native', 'Asian', 'Pacific Islander'],
    'Percentage Change 2018-2019': [white_percentage_change, black_percentage_change, aian_percentage_change, asian_percentage_change, pacific_percentage_change],
    'Population 2018': [Race_Info['WHITEPOP18'].sum(), Race_Info['BLACKPOP18'].sum(), Race_Info['AIANPOP18'].sum(), Race_Info['ASPOP18'].sum(), Race_Info['HOPPOP18'].sum()],
    'Population 2019': [Race_Info['WHITEPOP19'].sum(), Race_Info['BLACKPOP19'].sum(), Race_Info['AIANPOP19'].sum(), Race_Info['ASPOP19'].sum(), Race_Info['HOPPOP19'].sum()],
    'Racial Percentage 2018': [white_percentage_2018, black_percentage_2018, aian_percentage_2018, asian_percentage_2018, pacific_percentage_2018],
    'Racial Percentage 2019': [white_percentage_2019, black_percentage_2019, aian_percentage_2019, asian_percentage_2019, pacific_percentage_2019]
}

Race_Changes = pd.DataFrame(data)

new_order2 = ['Race', 'Population 2018', 'Population 2019', 'Racial Percentage 2018', 'Racial Percentage 2019', 'Percentage Change 2018-2019']
Race_Changes = Race_Changes[new_order2]

Race_Changes

,Race,Population 2018,Population 2019,Racial Percentage 2018,Racial Percentage 2019,Percentage Change 2018-2019
0,White,250139096,250522190,75.716533,75.832494,0.115962
1,Black,43804319,44075086,13.259467,13.341428,0.081961
2,American Indian and Alaska Native,4147521,4188092,1.255445,1.267726,0.012281
3,Asian,19330600,19504862,5.851328,5.904077,0.052749
4,Pacific Islander,799418,806937,0.241982,0.244258,0.002276

In [76]:
#converting into CSV
file_path = 'Race_Changes'
Race_Changes.to_csv(file_path, index=False)